export default [
  {
    id: 110000,
    label: "北京市",
    child: [
      {
        id: 110100,
        label: "市辖区",
        child: [
          {id: 110101, label: "东城区",},
          {id: 110102, label: "西城区",},
          {id: 110105, label: "朝阳区",},
          {id: 110106, label: "丰台区",},
          {id: 110107, label: "石景山区",},
          {id: 110108, label: "海淀区",},
          {id: 110109, label: "门头沟区",},
          {id: 110111, label: "房山区",},
          {id: 110112, label: "通州区",},
          {id: 110113, label: "顺义区",},
          {id: 110114, label: "昌平区",},
          {id: 110115, label: "大兴区",},
          {id: 110116, label: "怀柔区",},
          {id: 110117, label: "平谷区",},
          {id: 110118, label: "密云区",},
          {id: 110119, label: "延庆区",},
        ]
      },
    ]
  },
  {
    id: 120000,
    label: "天津市",
    child: [
      {
        id: 120100,
        label: "市辖区",
        child: [
          {id: 120101, label: "和平区",},
          {id: 120102, label: "河东区",},
          {id: 120103, label: "河西区",},
          {id: 120104, label: "南开区",},
          {id: 120105, label: "河北区",},
          {id: 120106, label: "红桥区",},
          {id: 120110, label: "东丽区",},
          {id: 120111, label: "西青区",},
          {id: 120112, label: "津南区",},
          {id: 120113, label: "北辰区",},
          {id: 120114, label: "武清区",},
          {id: 120115, label: "宝坻区",},
          {id: 120116, label: "滨海新区",},
          {id: 120117, label: "宁河区",},
          {id: 120118, label: "静海区",},
          {id: 120119, label: "蓟州区",
          },
        ]
      },
    ]
  },
  {
    id: 130000,
    label: "河北省",
    child: [
      {
        id: 139000,
        label: "省直辖县级行政区划",
        child: [
          {id: 139001, label: "定州市",},
          {id: 139002, label: "辛集市",},
        ]
      },
    ]
  },
  {
    id: 140000,
    label: "山西省",
    child: [
      {
        id: 141100,
        label: "吕梁市",
        child: [
          {id: 141101, label: "市辖区",},
          {id: 141102, label: "离石区",},
          {id: 141121, label: "文水县",},
          {id: 141122, label: "交城县",},
          {id: 141123, label: "兴县",},
          {id: 141124, label: "临县",},
          {id: 141125, label: "柳林县",},
          {id: 141126, label: "石楼县",},
          {id: 141127, label: "岚县",},
          {id: 141128, label: "方山县",},
          {id: 141129, label: "中阳县",},
          {id: 141130, label: "交口县",},
          {id: 141181, label: "孝义市",},
          {id: 141182, label: "汾阳市",},
        ]
      },
    ]
  },
  {
    id: 150000,
    label: "内蒙古自治区",
    child: [
      {
        id: 152900,
        label: "阿拉善盟",
        child: [
          {id: 152921, label: "阿拉善左旗",},
          {id: 152922, label: "阿拉善右旗",},
          {id: 152923, label: "额济纳旗",},
        ]
      },
    ]
  },
  {
    id: 210000,
    label: "辽宁省",
    child: [
      {
        id: 211400,
        label: "葫芦岛市",
        child: [
          {id: 211401, label: "市辖区",},
          {id: 211402, label: "连山区",},
          {id: 211403, label: "龙港区",},
          {id: 211404, label: "南票区",},
          {id: 211421, label: "绥中县",},
          {id: 211422, label: "建昌县",},
          {id: 211481, label: "兴城市",},
        ]
      },
    ]
  },
  {
    id: 220000,
    label: "吉林省",
    child: [
      {
        id: 222400,
        label: "延边朝鲜族自治州",
        child: [
          {id: 222401, label: "延吉市",},
          {id: 222402, label: "图们市",},
          {id: 222403, label: "敦化市",},
          {id: 222404, label: "珲春市",},
          {id: 222405, label: "龙井市",},
          {id: 222406, label: "和龙市",},
          {id: 222424, label: "汪清县",},
          {id: 222426, label: "安图县",},
        ]
      },
    ]
  },
  {
    id: 230000,
    label: "黑龙江省",
    child: [
      {
        id: 232700,
        label: "大兴安岭地区",
        child: [
          {id: 232721, label: "呼玛县",},
          {id: 232722, label: "塔河县",},
          {id: 232723, label: "漠河县",},
        ]
      },
    ]
  },
  {
    id: 310000,
    label: "上海市",
    child: [
      {
        id: 310100,
        label: "市辖区",
        child: [
          {id: 310101, label: "黄浦区",},
          {id: 310104, label: "徐汇区",},
          {id: 310105, label: "长宁区",},
          {id: 310106, label: "静安区",},
          {id: 310107, label: "普陀区",},
          {id: 310109, label: "虹口区",},
          {id: 310110, label: "杨浦区",},
          {id: 310112, label: "闵行区",},
          {id: 310113, label: "宝山区",},
          {id: 310114, label: "嘉定区",},
          {id: 310115, label: "浦东新区",},
          {id: 310116, label: "金山区",},
          {id: 310117, label: "松江区",},
          {id: 310118, label: "青浦区",},
          {id: 310120, label: "奉贤区",},
          {id: 310151, label: "崇明区",},
        ]
      },
    ]
  },
  {
    id: 320000,
    label: "江苏省",
    child: [
      {
        id: 321300,
        label: "宿迁市",
        child: [
          {id: 321301, label: "市辖区",},
          {id: 321302, label: "宿城区",},
          {id: 321311, label: "宿豫区",},
          {id: 321322, label: "沭阳县",},
          {id: 321323, label: "泗阳县",},
          {id: 321324, label: "泗洪县",},
        ]
      },
    ]
  },
  {
    id: 330000,
    label: "浙江省",
    child: [
      {
        id: 331100,
        label: "丽水市",
        child: [
          {id: 331101, label: "市辖区",},
          {id: 331102, label: "莲都区",},
          {id: 331121, label: "青田县",},
          {id: 331122, label: "缙云县",},
          {id: 331123, label: "遂昌县",},
          {id: 331124, label: "松阳县",},
          {id: 331125, label: "云和县",},
          {id: 331126, label: "庆元县",},
          {id: 331127, label: "景宁畲族自治县",},
          {id: 331181, label: "龙泉市",},
        ]
      },
    ]
  },
  {
    id: 340000,
    label: "安徽省",
    child: [
      {
        id: 341800,
        label: "宣城市",
        child: [
          {id: 341801, label: "市辖区",},
          {id: 341802, label: "宣州区",},
          {id: 341821, label: "郎溪县",},
          {id: 341822, label: "广德县",},
          {id: 341823, label: "泾县",},
          {id: 341824, label: "绩溪县",},
          {id: 341825, label: "旌德县",},
          {id: 341881, label: "宁国市",},
        ]
      },
    ]
  },
  {
    id: 350000,
    label: "福建省",
    child: [
      {
        id: 350900,
        label: "宁德市",
        child: [
          {id: 350901, label: "市辖区",},
          {id: 350902, label: "蕉城区",},
          {id: 350921, label: "霞浦县",},
          {id: 350922, label: "古田县",},
          {id: 350923, label: "屏南县",},
          {id: 350924, label: "寿宁县",},
          {id: 350925, label: "周宁县",},
          {id: 350926, label: "柘荣县",},
          {id: 350981, label: "福安市",},
          {id: 350982, label: "福鼎市",},
        ]
      },
    ]
  },
  {
    id: 360000,
    label: "江西省",
    child: [
      {
        id: 361100,
        label: "上饶市",
        child: [
          {id: 361101, label: "市辖区",},
          {id: 361102, label: "信州区",},
          {id: 361103, label: "广丰区",},
          {id: 361121, label: "上饶县",},
          {id: 361123, label: "玉山县",},
          {id: 361124, label: "铅山县",},
          {id: 361125, label: "横峰县",},
          {id: 361126, label: "弋阳县",},
          {id: 361127, label: "余干县",},
          {id: 361128, label: "鄱阳县",},
          {id: 361129, label: "万年县",},
          {id: 361130, label: "婺源县",},
          {id: 361181, label: "德兴市",},
        ]
      },
    ]
  },
  {
    id: 370000,
    label: "山东省",
    child: [
      {
        id: 371700,
        label: "菏泽市",
        child: [
          {id: 371701, label: "市辖区",},
          {id: 371702, label: "牡丹区",},
          {id: 371703, label: "定陶区",},
          {id: 371721, label: "曹县",},
          {id: 371722, label: "单县",},
          {id: 371723, label: "成武县",},
          {id: 371724, label: "巨野县",},
          {id: 371725, label: "郓城县",},
          {id: 371726, label: "鄄城县",},
          {id: 371728, label: "东明县",},
        ]
      },
    ]
  },
  {
    id: 410000,
    label: "河南省",
    child: [
      {id: 419000,
        label: "省直辖县级行政区划",
        child: [
          {id: 419001, label: "济源市",},
        ]
      },
    ]
  }, {
    id: 420000,
    label: "湖北省",
    child: [{
      id: 429000,
      label: "省直辖县级行政区划",
      child: [{id: 429004, label: "仙桃市",}, {id: 429005, label: "潜江市",}, {id: 429006, label: "天门市",}, {
        id: 429021,
        label: "神农架林区",
      },]
    },]
  }, {
    id: 430000,
    label: "湖南省",
    child: [{
      id: 433100,
      label: "湘西土家族苗族自治州",
      child: [{id: 433101, label: "吉首市",}, {id: 433122, label: "泸溪县",}, {id: 433123, label: "凤凰县",}, {
        id: 433124,
        label: "花垣县",
      }, {id: 433125, label: "保靖县",}, {id: 433126, label: "古丈县",}, {id: 433127, label: "永顺县",}, {
        id: 433130,
        label: "龙山县",
      },]
    },]
  }, {
    id: 440000,
    label: "广东省",
    child: [{
      id: 445300,
      label: "云浮市",
      child: [{id: 445301, label: "市辖区",}, {id: 445302, label: "云城区",}, {id: 445303, label: "云安区",}, {
        id: 445321,
        label: "新兴县",
      }, {id: 445322, label: "郁南县",}, {id: 445381, label: "罗定市",},]
    },]
  }, {
    id: 450000,
    label: "广西壮族自治区",
    child: [{
      id: 451400,
      label: "崇左市",
      child: [{id: 451401, label: "市辖区",}, {id: 451402, label: "江州区",}, {id: 451421, label: "扶绥县",}, {
        id: 451422,
        label: "宁明县",
      }, {id: 451423, label: "龙州县",}, {id: 451424, label: "大新县",}, {id: 451425, label: "天等县",}, {
        id: 451481,
        label: "凭祥市",
      },]
    },]
  }, {
    id: 460000,
    label: "海南省",
    child: [{
      id: 469000,
      label: "省直辖县级行政区划",
      child: [{id: 469001, label: "五指山市",}, {id: 469002, label: "琼海市",}, {id: 469005, label: "文昌市",}, {
        id: 469006,
        label: "万宁市",
      }, {id: 469007, label: "东方市",}, {id: 469021, label: "定安县",}, {id: 469022, label: "屯昌县",}, {
        id: 469023,
        label: "澄迈县",
      }, {id: 469024, label: "临高县",}, {id: 469025, label: "白沙黎族自治县",}, {id: 469026, label: "昌江黎族自治县",}, {
        id: 469027,
        label: "乐东黎族自治县",
      }, {id: 469028, label: "陵水黎族自治县",}, {id: 469029, label: "保亭黎族苗族自治县",}, {id: 469030, label: "琼中黎族苗族自治县",},]
    },]
  }, {
    id: 500000,
    label: "重庆市",
    child: [{
      id: 500200,
      label: "县",
      child: [{id: 500228, label: "梁平县",}, {id: 500229, label: "城口县",}, {id: 500230, label: "丰都县",}, {
        id: 500231,
        label: "垫江县",
      }, {id: 500232, label: "武隆县",}, {id: 500233, label: "忠县",}, {id: 500235, label: "云阳县",}, {
        id: 500236,
        label: "奉节县",
      }, {id: 500237, label: "巫山县",}, {id: 500238, label: "巫溪县",}, {id: 500240, label: "石柱土家族自治县",}, {
        id: 500241,
        label: "秀山土家族苗族自治县",
      }, {id: 500242, label: "酉阳土家族苗族自治县",}, {id: 500243, label: "彭水苗族土家族自治县",},]
    },]
  }, {
    id: 510000,
    label: "四川省",
    child: [{
      id: 513400,
      label: "凉山彝族自治州",
      child: [{id: 513401, label: "西昌市",}, {id: 513422, label: "木里藏族自治县",}, {id: 513423, label: "盐源县",}, {
        id: 513424,
        label: "德昌县",
      }, {id: 513425, label: "会理县",}, {id: 513426, label: "会东县",}, {id: 513427, label: "宁南县",}, {
        id: 513428,
        label: "普格县",
      }, {id: 513429, label: "布拖县",}, {id: 513430, label: "金阳县",}, {id: 513431, label: "昭觉县",}, {
        id: 513432,
        label: "喜德县",
      }, {id: 513433, label: "冕宁县",}, {id: 513434, label: "越西县",}, {id: 513435, label: "甘洛县",}, {
        id: 513436,
        label: "美姑县",
      }, {id: 513437, label: "雷波县",},]
    },]
  }, {
    id: 520000,
    label: "贵州省",
    child: [{
      id: 522700,
      label: "黔南布依族苗族自治州",
      child: [{id: 522701, label: "都匀市",}, {id: 522702, label: "福泉市",}, {id: 522722, label: "荔波县",}, {
        id: 522723,
        label: "贵定县",
      }, {id: 522725, label: "瓮安县",}, {id: 522726, label: "独山县",}, {id: 522727, label: "平塘县",}, {
        id: 522728,
        label: "罗甸县",
      }, {id: 522729, label: "长顺县",}, {id: 522730, label: "龙里县",}, {id: 522731, label: "惠水县",}, {
        id: 522732,
        label: "三都水族自治县",
      },]
    },]
  }, {
    id: 530000,
    label: "云南省",
    child: [{
      id: 533400,
      label: "迪庆藏族自治州",
      child: [{id: 533401, label: "香格里拉市",}, {id: 533422, label: "德钦县",}, {id: 533423, label: "维西傈僳族自治县",},]
    },]
  }, {
    id: 540000,
    label: "西藏自治区",
    child: [{
      id: 542500,
      label: "阿里地区",
      child: [{id: 542521, label: "普兰县",}, {id: 542522, label: "札达县",}, {id: 542523, label: "噶尔县",}, {
        id: 542524,
        label: "日土县",
      }, {id: 542525, label: "革吉县",}, {id: 542526, label: "改则县",}, {id: 542527, label: "措勤县",},]
    },]
  }, {
    id: 610000,
    label: "陕西省",
    child: [{
      id: 611000,
      label: "商洛市",
      child: [{id: 611001, label: "市辖区",}, {id: 611002, label: "商州区",}, {id: 611021, label: "洛南县",}, {
        id: 611022,
        label: "丹凤县",
      }, {id: 611023, label: "商南县",}, {id: 611024, label: "山阳县",}, {id: 611025, label: "镇安县",}, {
        id: 611026,
        label: "柞水县",
      },]
    },]
  }, {
    id: 620000,
    label: "甘肃省",
    child: [{
      id: 623000,
      label: "甘南藏族自治州",
      child: [{id: 623001, label: "合作市",}, {id: 623021, label: "临潭县",}, {id: 623022, label: "卓尼县",}, {
        id: 623023,
        label: "舟曲县",
      }, {id: 623024, label: "迭部县",}, {id: 623025, label: "玛曲县",}, {id: 623026, label: "碌曲县",}, {
        id: 623027,
        label: "夏河县",
      },]
    },]
  }, {
    id: 630000,
    label: "青海省",
    child: [{
      id: 632800,
      label: "海西蒙古族藏族自治州",
      child: [{id: 632801, label: "格尔木市",}, {id: 632802, label: "德令哈市",}, {id: 632821, label: "乌兰县",}, {
        id: 632822,
        label: "都兰县",
      }, {id: 632823, label: "天峻县",},]
    },]
  }, {
    id: 640000,
    label: "宁夏回族自治区",
    child: [{
      id: 640500,
      label: "中卫市",
      child: [{id: 640501, label: "市辖区",}, {id: 640502, label: "沙坡头区",}, {id: 640521, label: "中宁县",}, {
        id: 640522,
        label: "海原县",
      },]
    },]
  }, {
    id: 650000,
    label: "新疆维吾尔自治区",
    child: [{
      id: 659000,
      label: "自治区直辖县级行政区划",
      child: [{id: 659001, label: "石河子市",}, {id: 659002, label: "阿拉尔市",}, {id: 659003, label: "图木舒克市",}, {
        id: 659004,
        label: "五家渠市",
      }, {id: 659006, label: "铁门关市",},]
    },]
  }, {
    id: 710000,
    label: "台湾省",
    child: [{
      id: 659000,
      label: "自治区直辖县级行政区划",
      child: [{id: 659001, label: "石河子市",}, {id: 659002, label: "阿拉尔市",}, {id: 659003, label: "图木舒克市",}, {
        id: 659004,
        label: "五家渠市",
      }, {id: 659006, label: "铁门关市",},]
    },]
  }, {
    id: 810000,
    label: "香港特别行政区",
    child: [{
      id: 659000,
      label: "自治区直辖县级行政区划",
      child: [{id: 659001, label: "石河子市",}, {id: 659002, label: "阿拉尔市",}, {id: 659003, label: "图木舒克市",}, {
        id: 659004,
        label: "五家渠市",
      }, {id: 659006, label: "铁门关市",},]
    },]
  }, {
    id: 820000,
    label: "澳门特别行政区",
    child: [{
      id: 659000,
      label: "自治区直辖县级行政区划",
      child: [{id: 659001, label: "石河子市",}, {id: 659002, label: "阿拉尔市",}, {id: 659003, label: "图木舒克市",}, {
        id: 659004,
        label: "五家渠市",
      }, {id: 659006, label: "铁门关市",},]
    },]
  },]
